{
  "class_name": "Model",
  "config": {
    "name": "generator_model",
    "layers": [
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            10,
            10,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "input_2",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            100,
            100,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_2"
        },
        "inbound_nodes": []
      },
      {
        "name": "input_3",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            20,
            20,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_3"
        },
        "inbound_nodes": []
      },
      {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            30,
            30
          ],
          "strides": [
            10,
            10
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "filters": 32,
          "kernel_size": [
            6,
            6
          ],
          "strides": [
            2,
            2
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "concatenate_1",
        "class_name": "Concatenate",
        "config": {
          "name": "concatenate_1",
          "trainable": true,
          "axis": -1
        },
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ],
            [
              "conv2d_2",
              0,
              0,
              {}
            ],
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "concatenate_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_1",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_1",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_5",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_1",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_2",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_2",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_6",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_2",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_1",
        "class_name": "Add",
        "config": {
          "name": "add_1",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_2",
              0,
              0,
              {}
            ],
            [
              "p_re_lu_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_7",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_7",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_3",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_3",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_3",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_3",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_8",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_4",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_4",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_2",
        "class_name": "Add",
        "config": {
          "name": "add_2",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ],
            [
              "add_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_9",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_5",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_5",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_4",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_4",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_10",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_10",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_6",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_6",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_3",
        "class_name": "Add",
        "config": {
          "name": "add_3",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ],
            [
              "add_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_11",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_11",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_7",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_7",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_5",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_5",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_12",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_12",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_8",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_8",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_4",
        "class_name": "Add",
        "config": {
          "name": "add_4",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ],
            [
              "add_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_13",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_13",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_9",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_9",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_6",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_6",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_14",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_14",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_10",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_14",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_5",
        "class_name": "Add",
        "config": {
          "name": "add_5",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ],
            [
              "add_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_15",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_15",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_11",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_11",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_7",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_7",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_16",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_16",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_12",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_12",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_16",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_6",
        "class_name": "Add",
        "config": {
          "name": "add_6",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_12",
              0,
              0,
              {}
            ],
            [
              "add_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_17",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_17",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_13",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_13",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_17",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_8",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_8",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_18",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_18",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "p_re_lu_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_14",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_14",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_18",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "add_7",
        "class_name": "Add",
        "config": {
          "name": "add_7",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_14",
              0,
              0,
              {}
            ],
            [
              "add_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_19",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_19",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "add_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "batch_normalization_15",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_15",
          "trainable": true,
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "p_re_lu_9",
        "class_name": "PReLU",
        "config": {
          "name": "p_re_lu_9",
          "trainable": true,
          "alpha_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "alpha_regularizer": null,
          "alpha_constraint": null,
          "shared_axes": [
            1,
            2
          ]
        },
        "inbound_nodes": [
          [
            [
              "batch_normalization_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
