ir_version: 4
producer_name: "Chainer"
producer_version: "7.0.0b2"
graph {
  node {
    input: "Input_3"
    input: "param_input_block_conv_on_W3_W"
    input: "param_input_block_conv_on_W3_b"
    output: "Convolution2DFunction_0"
    name: "Convolution2DFunction_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Input_2"
    input: "param_input_block_conv_on_W2_W"
    input: "param_input_block_conv_on_W2_b"
    output: "Convolution2DFunction_1"
    name: "Convolution2DFunction_1"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "Input_1"
    input: "param_input_block_conv_on_W1_W"
    input: "param_input_block_conv_on_W1_b"
    output: "Convolution2DFunction_2"
    name: "Convolution2DFunction_2"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 30
      ints: 30
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 10
      ints: 10
      type: INTS
    }
  }
  node {
    input: "Input_0"
    input: "param_input_block_conv_on_X_W"
    input: "param_input_block_conv_on_X_b"
    output: "Convolution2DFunction_3"
    name: "Convolution2DFunction_3"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_3"
    input: "Convolution2DFunction_2"
    input: "Convolution2DFunction_1"
    input: "Convolution2DFunction_0"
    output: "Concat_0"
    name: "Concat_0"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_0"
    input: "param_pre_residual_conv_layer_W"
    input: "param_pre_residual_conv_layer_b"
    output: "Convolution2DFunction_4"
    name: "Convolution2DFunction_4"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_4"
    output: "LeakyReLU_0"
    name: "LeakyReLU_0"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "LeakyReLU_0"
    input: "param_residual_network_0_residual_dense_block1_conv_layer1_W"
    input: "param_residual_network_0_residual_dense_block1_conv_layer1_b"
    output: "Convolution2DFunction_5"
    name: "Convolution2DFunction_5"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_5"
    output: "LeakyReLU_1"
    name: "LeakyReLU_1"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "LeakyReLU_0"
    input: "LeakyReLU_1"
    output: "Concat_1"
    name: "Concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_1"
    input: "param_residual_network_0_residual_dense_block1_conv_layer2_W"
    input: "param_residual_network_0_residual_dense_block1_conv_layer2_b"
    output: "Convolution2DFunction_6"
    name: "Convolution2DFunction_6"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_6"
    output: "LeakyReLU_2"
    name: "LeakyReLU_2"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "LeakyReLU_0"
    input: "LeakyReLU_1"
    input: "LeakyReLU_2"
    output: "Concat_2"
    name: "Concat_2"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_2"
    input: "param_residual_network_0_residual_dense_block1_conv_layer3_W"
    input: "param_residual_network_0_residual_dense_block1_conv_layer3_b"
    output: "Convolution2DFunction_7"
    name: "Convolution2DFunction_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_7"
    output: "LeakyReLU_3"
    name: "LeakyReLU_3"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "LeakyReLU_0"
    input: "LeakyReLU_1"
    input: "LeakyReLU_2"
    input: "LeakyReLU_3"
    output: "Concat_3"
    name: "Concat_3"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_3"
    input: "param_residual_network_0_residual_dense_block1_conv_layer4_W"
    input: "param_residual_network_0_residual_dense_block1_conv_layer4_b"
    output: "Convolution2DFunction_8"
    name: "Convolution2DFunction_8"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_8"
    output: "LeakyReLU_4"
    name: "LeakyReLU_4"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "LeakyReLU_0"
    input: "LeakyReLU_1"
    input: "LeakyReLU_2"
    input: "LeakyReLU_3"
    input: "LeakyReLU_4"
    output: "Concat_4"
    name: "Concat_4"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_4"
    input: "param_residual_network_0_residual_dense_block1_conv_layer5_W"
    input: "param_residual_network_0_residual_dense_block1_conv_layer5_b"
    output: "Convolution2DFunction_9"
    name: "Convolution2DFunction_9"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_9"
    input: "v791"
    output: "MulConstant_0"
    name: "MulConstant_0"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_0"
    input: "LeakyReLU_0"
    output: "Add_0"
    name: "Add_0"
    op_type: "Add"
  }
  node {
    input: "Add_0"
    input: "param_residual_network_0_residual_dense_block2_conv_layer1_W"
    input: "param_residual_network_0_residual_dense_block2_conv_layer1_b"
    output: "Convolution2DFunction_10"
    name: "Convolution2DFunction_10"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_10"
    output: "LeakyReLU_5"
    name: "LeakyReLU_5"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_0"
    input: "LeakyReLU_5"
    output: "Concat_5"
    name: "Concat_5"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_5"
    input: "param_residual_network_0_residual_dense_block2_conv_layer2_W"
    input: "param_residual_network_0_residual_dense_block2_conv_layer2_b"
    output: "Convolution2DFunction_11"
    name: "Convolution2DFunction_11"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_11"
    output: "LeakyReLU_6"
    name: "LeakyReLU_6"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_0"
    input: "LeakyReLU_5"
    input: "LeakyReLU_6"
    output: "Concat_6"
    name: "Concat_6"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_6"
    input: "param_residual_network_0_residual_dense_block2_conv_layer3_W"
    input: "param_residual_network_0_residual_dense_block2_conv_layer3_b"
    output: "Convolution2DFunction_12"
    name: "Convolution2DFunction_12"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_12"
    output: "LeakyReLU_7"
    name: "LeakyReLU_7"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_0"
    input: "LeakyReLU_5"
    input: "LeakyReLU_6"
    input: "LeakyReLU_7"
    output: "Concat_7"
    name: "Concat_7"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_7"
    input: "param_residual_network_0_residual_dense_block2_conv_layer4_W"
    input: "param_residual_network_0_residual_dense_block2_conv_layer4_b"
    output: "Convolution2DFunction_13"
    name: "Convolution2DFunction_13"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_13"
    output: "LeakyReLU_8"
    name: "LeakyReLU_8"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_0"
    input: "LeakyReLU_5"
    input: "LeakyReLU_6"
    input: "LeakyReLU_7"
    input: "LeakyReLU_8"
    output: "Concat_8"
    name: "Concat_8"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_8"
    input: "param_residual_network_0_residual_dense_block2_conv_layer5_W"
    input: "param_residual_network_0_residual_dense_block2_conv_layer5_b"
    output: "Convolution2DFunction_14"
    name: "Convolution2DFunction_14"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_14"
    input: "v808"
    output: "MulConstant_1"
    name: "MulConstant_1"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_1"
    input: "Add_0"
    output: "Add_1"
    name: "Add_1"
    op_type: "Add"
  }
  node {
    input: "Add_1"
    input: "param_residual_network_0_residual_dense_block3_conv_layer1_W"
    input: "param_residual_network_0_residual_dense_block3_conv_layer1_b"
    output: "Convolution2DFunction_15"
    name: "Convolution2DFunction_15"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_15"
    output: "LeakyReLU_9"
    name: "LeakyReLU_9"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_1"
    input: "LeakyReLU_9"
    output: "Concat_9"
    name: "Concat_9"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_9"
    input: "param_residual_network_0_residual_dense_block3_conv_layer2_W"
    input: "param_residual_network_0_residual_dense_block3_conv_layer2_b"
    output: "Convolution2DFunction_16"
    name: "Convolution2DFunction_16"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_16"
    output: "LeakyReLU_10"
    name: "LeakyReLU_10"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_1"
    input: "LeakyReLU_9"
    input: "LeakyReLU_10"
    output: "Concat_10"
    name: "Concat_10"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_10"
    input: "param_residual_network_0_residual_dense_block3_conv_layer3_W"
    input: "param_residual_network_0_residual_dense_block3_conv_layer3_b"
    output: "Convolution2DFunction_17"
    name: "Convolution2DFunction_17"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_17"
    output: "LeakyReLU_11"
    name: "LeakyReLU_11"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_1"
    input: "LeakyReLU_9"
    input: "LeakyReLU_10"
    input: "LeakyReLU_11"
    output: "Concat_11"
    name: "Concat_11"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_11"
    input: "param_residual_network_0_residual_dense_block3_conv_layer4_W"
    input: "param_residual_network_0_residual_dense_block3_conv_layer4_b"
    output: "Convolution2DFunction_18"
    name: "Convolution2DFunction_18"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_18"
    output: "LeakyReLU_12"
    name: "LeakyReLU_12"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_1"
    input: "LeakyReLU_9"
    input: "LeakyReLU_10"
    input: "LeakyReLU_11"
    input: "LeakyReLU_12"
    output: "Concat_12"
    name: "Concat_12"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_12"
    input: "param_residual_network_0_residual_dense_block3_conv_layer5_W"
    input: "param_residual_network_0_residual_dense_block3_conv_layer5_b"
    output: "Convolution2DFunction_19"
    name: "Convolution2DFunction_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_19"
    input: "v825"
    output: "MulConstant_2"
    name: "MulConstant_2"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_2"
    input: "Add_1"
    output: "Add_2"
    name: "Add_2"
    op_type: "Add"
  }
  node {
    input: "Add_2"
    input: "v829"
    output: "MulConstant_3"
    name: "MulConstant_3"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_3"
    input: "LeakyReLU_0"
    output: "Add_3"
    name: "Add_3"
    op_type: "Add"
  }
  node {
    input: "Add_3"
    input: "param_residual_network_11_residual_dense_block1_conv_layer1_W"
    input: "param_residual_network_11_residual_dense_block1_conv_layer1_b"
    output: "Convolution2DFunction_20"
    name: "Convolution2DFunction_20"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_20"
    output: "LeakyReLU_13"
    name: "LeakyReLU_13"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_3"
    input: "LeakyReLU_13"
    output: "Concat_13"
    name: "Concat_13"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_13"
    input: "param_residual_network_11_residual_dense_block1_conv_layer2_W"
    input: "param_residual_network_11_residual_dense_block1_conv_layer2_b"
    output: "Convolution2DFunction_21"
    name: "Convolution2DFunction_21"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_21"
    output: "LeakyReLU_14"
    name: "LeakyReLU_14"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_3"
    input: "LeakyReLU_13"
    input: "LeakyReLU_14"
    output: "Concat_14"
    name: "Concat_14"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_14"
    input: "param_residual_network_11_residual_dense_block1_conv_layer3_W"
    input: "param_residual_network_11_residual_dense_block1_conv_layer3_b"
    output: "Convolution2DFunction_22"
    name: "Convolution2DFunction_22"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_22"
    output: "LeakyReLU_15"
    name: "LeakyReLU_15"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_3"
    input: "LeakyReLU_13"
    input: "LeakyReLU_14"
    input: "LeakyReLU_15"
    output: "Concat_15"
    name: "Concat_15"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_15"
    input: "param_residual_network_11_residual_dense_block1_conv_layer4_W"
    input: "param_residual_network_11_residual_dense_block1_conv_layer4_b"
    output: "Convolution2DFunction_23"
    name: "Convolution2DFunction_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_23"
    output: "LeakyReLU_16"
    name: "LeakyReLU_16"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_3"
    input: "LeakyReLU_13"
    input: "LeakyReLU_14"
    input: "LeakyReLU_15"
    input: "LeakyReLU_16"
    output: "Concat_16"
    name: "Concat_16"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_16"
    input: "param_residual_network_11_residual_dense_block1_conv_layer5_W"
    input: "param_residual_network_11_residual_dense_block1_conv_layer5_b"
    output: "Convolution2DFunction_24"
    name: "Convolution2DFunction_24"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_24"
    input: "v846"
    output: "MulConstant_4"
    name: "MulConstant_4"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_4"
    input: "Add_3"
    output: "Add_4"
    name: "Add_4"
    op_type: "Add"
  }
  node {
    input: "Add_4"
    input: "param_residual_network_11_residual_dense_block2_conv_layer1_W"
    input: "param_residual_network_11_residual_dense_block2_conv_layer1_b"
    output: "Convolution2DFunction_25"
    name: "Convolution2DFunction_25"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_25"
    output: "LeakyReLU_17"
    name: "LeakyReLU_17"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_4"
    input: "LeakyReLU_17"
    output: "Concat_17"
    name: "Concat_17"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_17"
    input: "param_residual_network_11_residual_dense_block2_conv_layer2_W"
    input: "param_residual_network_11_residual_dense_block2_conv_layer2_b"
    output: "Convolution2DFunction_26"
    name: "Convolution2DFunction_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_26"
    output: "LeakyReLU_18"
    name: "LeakyReLU_18"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_4"
    input: "LeakyReLU_17"
    input: "LeakyReLU_18"
    output: "Concat_18"
    name: "Concat_18"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_18"
    input: "param_residual_network_11_residual_dense_block2_conv_layer3_W"
    input: "param_residual_network_11_residual_dense_block2_conv_layer3_b"
    output: "Convolution2DFunction_27"
    name: "Convolution2DFunction_27"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_27"
    output: "LeakyReLU_19"
    name: "LeakyReLU_19"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_4"
    input: "LeakyReLU_17"
    input: "LeakyReLU_18"
    input: "LeakyReLU_19"
    output: "Concat_19"
    name: "Concat_19"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_19"
    input: "param_residual_network_11_residual_dense_block2_conv_layer4_W"
    input: "param_residual_network_11_residual_dense_block2_conv_layer4_b"
    output: "Convolution2DFunction_28"
    name: "Convolution2DFunction_28"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_28"
    output: "LeakyReLU_20"
    name: "LeakyReLU_20"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_4"
    input: "LeakyReLU_17"
    input: "LeakyReLU_18"
    input: "LeakyReLU_19"
    input: "LeakyReLU_20"
    output: "Concat_20"
    name: "Concat_20"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_20"
    input: "param_residual_network_11_residual_dense_block2_conv_layer5_W"
    input: "param_residual_network_11_residual_dense_block2_conv_layer5_b"
    output: "Convolution2DFunction_29"
    name: "Convolution2DFunction_29"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_29"
    input: "v863"
    output: "MulConstant_5"
    name: "MulConstant_5"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_5"
    input: "Add_4"
    output: "Add_5"
    name: "Add_5"
    op_type: "Add"
  }
  node {
    input: "Add_5"
    input: "param_residual_network_11_residual_dense_block3_conv_layer1_W"
    input: "param_residual_network_11_residual_dense_block3_conv_layer1_b"
    output: "Convolution2DFunction_30"
    name: "Convolution2DFunction_30"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_30"
    output: "LeakyReLU_21"
    name: "LeakyReLU_21"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_5"
    input: "LeakyReLU_21"
    output: "Concat_21"
    name: "Concat_21"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_21"
    input: "param_residual_network_11_residual_dense_block3_conv_layer2_W"
    input: "param_residual_network_11_residual_dense_block3_conv_layer2_b"
    output: "Convolution2DFunction_31"
    name: "Convolution2DFunction_31"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_31"
    output: "LeakyReLU_22"
    name: "LeakyReLU_22"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_5"
    input: "LeakyReLU_21"
    input: "LeakyReLU_22"
    output: "Concat_22"
    name: "Concat_22"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_22"
    input: "param_residual_network_11_residual_dense_block3_conv_layer3_W"
    input: "param_residual_network_11_residual_dense_block3_conv_layer3_b"
    output: "Convolution2DFunction_32"
    name: "Convolution2DFunction_32"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_32"
    output: "LeakyReLU_23"
    name: "LeakyReLU_23"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_5"
    input: "LeakyReLU_21"
    input: "LeakyReLU_22"
    input: "LeakyReLU_23"
    output: "Concat_23"
    name: "Concat_23"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_23"
    input: "param_residual_network_11_residual_dense_block3_conv_layer4_W"
    input: "param_residual_network_11_residual_dense_block3_conv_layer4_b"
    output: "Convolution2DFunction_33"
    name: "Convolution2DFunction_33"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_33"
    output: "LeakyReLU_24"
    name: "LeakyReLU_24"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_5"
    input: "LeakyReLU_21"
    input: "LeakyReLU_22"
    input: "LeakyReLU_23"
    input: "LeakyReLU_24"
    output: "Concat_24"
    name: "Concat_24"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_24"
    input: "param_residual_network_11_residual_dense_block3_conv_layer5_W"
    input: "param_residual_network_11_residual_dense_block3_conv_layer5_b"
    output: "Convolution2DFunction_34"
    name: "Convolution2DFunction_34"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_34"
    input: "v880"
    output: "MulConstant_6"
    name: "MulConstant_6"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_6"
    input: "Add_5"
    output: "Add_6"
    name: "Add_6"
    op_type: "Add"
  }
  node {
    input: "Add_6"
    input: "v884"
    output: "MulConstant_7"
    name: "MulConstant_7"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_7"
    input: "Add_3"
    output: "Add_7"
    name: "Add_7"
    op_type: "Add"
  }
  node {
    input: "Add_7"
    input: "param_residual_network_10_residual_dense_block1_conv_layer1_W"
    input: "param_residual_network_10_residual_dense_block1_conv_layer1_b"
    output: "Convolution2DFunction_35"
    name: "Convolution2DFunction_35"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_35"
    output: "LeakyReLU_25"
    name: "LeakyReLU_25"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_7"
    input: "LeakyReLU_25"
    output: "Concat_25"
    name: "Concat_25"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_25"
    input: "param_residual_network_10_residual_dense_block1_conv_layer2_W"
    input: "param_residual_network_10_residual_dense_block1_conv_layer2_b"
    output: "Convolution2DFunction_36"
    name: "Convolution2DFunction_36"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_36"
    output: "LeakyReLU_26"
    name: "LeakyReLU_26"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_7"
    input: "LeakyReLU_25"
    input: "LeakyReLU_26"
    output: "Concat_26"
    name: "Concat_26"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_26"
    input: "param_residual_network_10_residual_dense_block1_conv_layer3_W"
    input: "param_residual_network_10_residual_dense_block1_conv_layer3_b"
    output: "Convolution2DFunction_37"
    name: "Convolution2DFunction_37"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_37"
    output: "LeakyReLU_27"
    name: "LeakyReLU_27"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_7"
    input: "LeakyReLU_25"
    input: "LeakyReLU_26"
    input: "LeakyReLU_27"
    output: "Concat_27"
    name: "Concat_27"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_27"
    input: "param_residual_network_10_residual_dense_block1_conv_layer4_W"
    input: "param_residual_network_10_residual_dense_block1_conv_layer4_b"
    output: "Convolution2DFunction_38"
    name: "Convolution2DFunction_38"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_38"
    output: "LeakyReLU_28"
    name: "LeakyReLU_28"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_7"
    input: "LeakyReLU_25"
    input: "LeakyReLU_26"
    input: "LeakyReLU_27"
    input: "LeakyReLU_28"
    output: "Concat_28"
    name: "Concat_28"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_28"
    input: "param_residual_network_10_residual_dense_block1_conv_layer5_W"
    input: "param_residual_network_10_residual_dense_block1_conv_layer5_b"
    output: "Convolution2DFunction_39"
    name: "Convolution2DFunction_39"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_39"
    input: "v901"
    output: "MulConstant_8"
    name: "MulConstant_8"
    op_type: "Mul"
  }
  node {
    input: "MulConstant_8"
    input: "Add_7"
    output: "Add_8"
    name: "Add_8"
    op_type: "Add"
  }
  node {
    input: "Add_8"
    input: "param_residual_network_10_residual_dense_block2_conv_layer1_W"
    input: "param_residual_network_10_residual_dense_block2_conv_layer1_b"
    output: "Convolution2DFunction_40"
    name: "Convolution2DFunction_40"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_40"
    output: "LeakyReLU_29"
    name: "LeakyReLU_29"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_8"
    input: "LeakyReLU_29"
    output: "Concat_29"
    name: "Concat_29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_29"
    input: "param_residual_network_10_residual_dense_block2_conv_layer2_W"
    input: "param_residual_network_10_residual_dense_block2_conv_layer2_b"
    output: "Convolution2DFunction_41"
    name: "Convolution2DFunction_41"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_41"
    output: "LeakyReLU_30"
    name: "LeakyReLU_30"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_8"
    input: "LeakyReLU_29"
    input: "LeakyReLU_30"
    output: "Concat_30"
    name: "Concat_30"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_30"
    input: "param_residual_network_10_residual_dense_block2_conv_layer3_W"
    input: "param_residual_network_10_residual_dense_block2_conv_layer3_b"
    output: "Convolution2DFunction_42"
    name: "Convolution2DFunction_42"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_42"
    output: "LeakyReLU_31"
    name: "LeakyReLU_31"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_8"
    input: "LeakyReLU_29"
    input: "LeakyReLU_30"
    input: "LeakyReLU_31"
    output: "Concat_31"
    name: "Concat_31"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_31"
    input: "param_residual_network_10_residual_dense_block2_conv_layer4_W"
    input: "param_residual_network_10_residual_dense_block2_conv_layer4_b"
    output: "Convolution2DFunction_43"
    name: "Convolution2DFunction_43"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "Convolution2DFunction_43"
    output: "LeakyReLU_32"
    name: "LeakyReLU_32"
    op_type: "LeakyRelu"
    attribute {
      name: "alpha"
      f: 0.20000000298023224
      type: FLOAT
    }
  }
  node {
    input: "Add_8"
    input: "LeakyReLU_29"
    input: "LeakyReLU_30"
    input: "LeakyReLU_31"
    input: "LeakyReLU_32"
    output: "Concat_32"
    name: "Concat_32"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Concat_32"
    input: "param_residual_network_10_residual_dense_block2_conv_layer5_W"
    input: "param_residual_network_10_residual_dense_block2_conv_layer5_b"
    output: "Convolution2DFunction_44"
    name: "Convolution2DFunction_44"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
